import re
from typing import Dict, List, Any

def parse_value(value: str) -> str:
    pattern = r'\{\{(.*?)\}\}'
    matches = re.findall(pattern, value, re.DOTALL)
    parsed_data = ''
    for match in matches:
        parts = [p.strip() for p in match.split('|')]
        if not parts:
            continue
        parsed_data += f"{parts[1]}*{parts[0]}\n"
    return parsed_data
   

def parse_materials(text_block: str) -> Dict:
    """素材解析器"""
    data = {}
    # print(text_block)
    blocks = text_block.split('\n')
    for block in blocks:
        
        if '灵衣一览' in block or '{{' == block[:2] or "}}" == block[:2] or not block.strip():
            continue
        block = block.strip('|')

        if '=' in block:
            key, value = block.split('=', 1)
            if '->' in key:
                a, b = key.split('->')
                data[f"等级{a} -> 等级{b}"] = f"等级{a}到等级{b}，需要的素材为{parse_value(value)}"
        else:

            data['总计消耗'] = parse_value(block)
        
    return data

                
def parse_noble_materials(np_section_text: str) -> List[Dict[str, str]]:
    """技能解析器"""
    result = []
    blocks = re.split(r'===(.*?)\s*===', np_section_text, flags=re.DOTALL)
    for i in range(1, len(blocks), 2):
        title = blocks[i].strip()
        content = blocks[i+1]
        result.append({
            title: parse_materials(content)
        })

    return result

# --- 原始数据块 ---
raw_skill_text = """
==素材需求==
===灵基再临（从者进化）===
{{灵基再临素材
|稀有度=5
|0->1={{材料消耗|剑阶银棋|5}}
|1->2={{材料消耗|剑阶银棋|12}}{{材料消耗|龙之牙|18}}
|2->3={{材料消耗|剑阶金像|5}}{{材料消耗|英雄之证|29}}{{材料消耗|凤凰羽毛|4}}
|3->4={{材料消耗|剑阶金像|12}}{{材料消耗|凤凰羽毛|8}}{{材料消耗|龙之逆鳞|5}}
|总计={{材料消耗|剑阶银棋|17}}{{材料消耗|剑阶金像|17}}{{材料消耗|英雄之证|29}}{{材料消耗|龙之牙|18}}{{材料消耗|凤凰羽毛|12}}{{材料消耗|龙之逆鳞|5}}
}}

===技能强化===
{{技能升级素材
|稀有度=5
|1->2={{材料消耗|剑之辉石|5}}
|2->3={{材料消耗|剑之辉石|12}}
|3->4={{材料消耗|剑之魔石|5}}
|4->5={{材料消耗|剑之魔石|12}}{{材料消耗|英雄之证|15}}
|5->6={{材料消耗|剑之秘石|5}}{{材料消耗|英雄之证|29}}
|6->7={{材料消耗|剑之秘石|12}}{{材料消耗|龙之牙|12}}
|7->8={{材料消耗|龙之牙|24}}{{材料消耗|混沌之爪|4}}
|8->9={{材料消耗|混沌之爪|11}}{{材料消耗|龙之逆鳞|10}}
|9->10={{材料消耗|传承结晶|1}}
|总计={{材料消耗|剑之辉石|17}}{{材料消耗|剑之魔石|17}}{{材料消耗|剑之秘石|17}}{{材料消耗|英雄之证|44}}{{材料消耗|龙之牙|36}}{{材料消耗|龙之逆鳞|10}}{{材料消耗|混沌之爪|15}}{{材料消耗|传承结晶|1}}
}}
===再临与技能总计===
{{素材消耗总计
|{{材料消耗|剑阶银棋|17}}{{材料消耗|剑阶金像|17}}{{材料消耗|剑之辉石|51}}{{材料消耗|剑之魔石|51}}{{材料消耗|剑之秘石|51}}{{材料消耗|英雄之证|161}}{{材料消耗|龙之牙|126}}{{材料消耗|凤凰羽毛|12}}{{材料消耗|龙之逆鳞|35}}{{材料消耗|混沌之爪|45}}{{材料消耗|传承结晶|3}}
|稀有度=5
}}
===灵衣开放===
{{参阅|灵衣一览|其他从者的灵衣相关信息}}
{{灵衣开放素材
|序号=41
|中文名称=简易灵衣：风王结界
|日文名称=簡易霊衣：風王結界
|素材={{材料消耗|龙之牙|10}}{{材料消耗|大骑士勋章|5}}{{材料消耗|凤凰羽毛|5}}{{材料消耗|龙之逆鳞|5}}
}}

===追加技能强化===
{{技能升级素材
|稀有度=5
|追加技能=1
|1->2={{材料消耗|剑之辉石|5}}
|2->3={{材料消耗|剑之辉石|12}}
|3->4={{材料消耗|剑之魔石|5}}
|4->5={{材料消耗|剑之魔石|12}}{{材料消耗|无间齿轮|5}}
|5->6={{材料消耗|剑之秘石|5}}{{材料消耗|无间齿轮|10}}
|6->7={{材料消耗|剑之秘石|12}}{{材料消耗|大骑士勋章|10}}
|7->8={{材料消耗|大骑士勋章|20}}{{材料消耗|极光之钢|6}}
|8->9={{材料消耗|极光之钢|18}}{{材料消耗|鬼炎鬼灯|10}}
|9->10={{材料消耗|传承结晶|1}}
|总计={{材料消耗|剑之辉石|17}}{{材料消耗|剑之魔石|17}}{{材料消耗|剑之秘石|17}}{{材料消耗|无间齿轮|15}}{{材料消耗|大骑士勋章|30}}{{材料消耗|极光之钢|24}}{{材料消耗|鬼炎鬼灯|10}}{{材料消耗|传承结晶|1}}
}}
"""


# --- 运行解析 ---
# parsed_material_data = parse_noble_materials(raw_skill_text)
# print(parsed_material_data)